{"isbn":"1617290653","title":"Functional Programming in Scala","description":"Functional Programming in Scala is a serious tutorial for programmers looking to learn FP and apply it to the everyday business of coding.","edition":2014,"classifications":["Technology","Programming"],"editorial":"Manning Pubns Co.","authors":[{"name":"Paul Chiusano","biography":"Has been writing and shipping functional code in Scala since 2008"},{"name":"Runar Bjarnason","biography":"Is a self-taught programmer with 12 years of industry experience"}]}
{"isbn":"1617291013","title":"Akka in Action","description":"Akka in Action is a comprehensive tutorial on building message-oriented systems using Akka. The book takes a hands-on approach, where each new concept is followed by an example that shows you how it works, how to implement the code, and how to (unit) test it.","edition":2016,"classifications":["Technology","Programming","Enterprise"],"editorial":"Manning Pubns Co.","authors":[{"name":"Raymond Roestenburg","biography":"Experienced software craftsman, polyglot programmer, and software architect"},{"name":"Rob Bakker","biography":"Experienced developer focused on concurrent back-end systems and system integration. He has used Scala and Akka in production from version 0.7."},{"name":"Rob Williams","biography":"Founder of ontometrics, a practice that has been focused on Java solutions that include machine learning"}]}
{"isbn":"0262033844","title":"Introduction to Algorithms","description":"Introduction to Algorithms uniquely combines rigor and comprehensiveness. The book covers a broad range of algorithms in depth, yet makes their design and analysis accessible to all levels of readers.","edition":2009,"classifications":["Computer Science","Computer Algorithms"],"editorial":"MIT Press","authors":[{"name":"Thomas H. Cormen","biography":"Thomas H. Cormen is Professor and former Chair of the Dartmouth College Department of Computer Science and former director of the Dartmouth College Institute for Writing and Rhetoric."},{"name":"Charles E. Leiserson","biography":"Charles E. Leiserson is Professor of Computer Science and Engineering at the Massachusetts Institute of Technology."},{"name":"Ronald L. Rivest","biography":"He is the inventor of the symmetric key encryption algorithms RC2, RC4, RC5, and co-inventor of RC6."},{"name":"Clifford Stein","biography":"Stein is chair of the Industrial Engineering and Operations Research Department at Columbia University. "}]}
{"isbn":"1517671272","title":"Elements of Programming Interviews in Java: The Insider's Guide","description":"This book prepares the reader for contemporary software interviews, and also provides a window into how algorithmic techniques translate into the workplace.","edition":2015,"classifications":["Memory Management Algorithms"],"editorial":" CreateSpace Independent Publishing Platform","authors":[{"name":"Adnan Aziz","biography":"Adnan Aziz is a research scientist at Facebook."},{"name":"Tsung-Hsien Lee","biography":"Tsung-Hsien Lee is a Senior Software Engineer at Uber working on self-driving cars."},{"name":"Amit Prakash","biography":"Amit Prakash is CTO and co-founder of ThoughtSpot Inc. Prior to that he worked at Google and Microsoft in Search and Ads engineering teams."}]}
{"isbn":"9780593055489","title":"The God delusion","description":"While Europe is secularized, the rise of religious fundamentalism, whether in the Middle East or Middle America, divides opinion around the world. This work attacks God in various forms, from the sex-obsessed, cruel tyrant of the Old Testament to the more benign, but still illogical, Celestial Watchmaker..","edition":2006,"classifications":["Atheism.","God -- Proof","God."],"editorial":"Bantam Press","authors":[{"name":"Richard Dawkins","biography":"Clinton Richard Dawkins (born March 26, 1941, Nairobi, Kenya), British evolutionary biologist, ethologist, and popular-science writer who emphasized the gene as the driving force of evolution ."}]}
{"isbn":"9781473217386","title":"Neuromancer","description":"The Matrix unfolds like neon origami beneath clusters and constellations of data. Constructs, AIs, live here. Somewhere, concealed by ice, Neuromancer is evolving. As entropy goes into reverse, Molly's surgical implants broadcast trouble from the ferro-concrete geodesic of the Sprawl. Maelcum, Rastafarian in space, is her best hope of rescue. But she and Case, computer cowboy, are busy stealing data from the almighty Megacorps. If the Megacorps do not get them both, perhaps Case will fall prey to the cheap treachery of Linda Lee, someone as lost as himself. ","edition":2016,"classifications":["Science fiction","Fiction"],"editorial":"Gollancz","authors":[{"name":"William Gibson","biography":"William Ford Gibson (born March 17, 1948) is an American-Canadian speculative fiction writer and essayist widely credited with pioneering the science fiction subgenre known as cyberpunk."}]}
{"isbn":"9781444806977","title":"A study in scarlet","description":"In London, Dr John Watson convalesces, after his disastrous Afghan war experiences. Sharing rooms with an enigmatic, new acquaintance, Sherlock Holmes, their quiet bachelor life at 221B Baker Street is short-lived. A dead man is discovered in a grimy house in south-east London. His face contorted with horror and hatred. On the wall, the word 'rache' - German for 'revenge' - is written in blood, yet there are no wounds on the victim or signs of a struggle. Watson's head is in a whirl, but the formidable Holmes relishes the challenge - and a famous investigative partnership begins. ","edition":2016,"classifications":["Detective","Fiction"],"editorial":"Leicester","authors":[{"name":"Arthur Conan Doyle","biography":"Sir Arthur Ignatius Conan Doyle (22 May 1859 – 7 July 1930) was a British writer best known for his detective fiction featuring the character Sherlock Holmes. Originally a physician, in 1887 he published A Study in Scarlet, the first of four novels about Holmes and Dr. Watson. In addition, Doyle wrote over fifty short stories featuring the famous detective. "}]}
{"isbn":"1245789630","title":"El Último Héroe","description":"En un futuro distante, donde los súper-humanos son fabricados la justicia ha llegado por fin.","edition":2015,"classifications":["Ficcion","Accion"],"editorial":"Babelcube Books","authors":[{"name":"Craig Gaydas","biography":"Has been writing books with a high point of fiction and action"}]}
{"isbn":"1597534568","title":"Ganga bruta: El imperio del crimen","description":"Novela inspirada en hechos reales, cualquier parecido con algun personaje es pura casualidad","edition":2017,"classifications":["Fiction"],"editorial":"Romeo Ebooks.","authors":[{"name":"Alfredo De Braganza","biography":"Nacido no se donde , cuya actividad desconozco, ha participado en algunas conferencias que tampoco se."}]}
{"isbn":"9786074151152","title":"SELECCION: ASI HABLO ZARATUSTRA; MAS ALLA DEL BIEN Y DEL MAL; LA GENEALOGIA DE LA MORAL; EL ANTICRISTO","description":"La influencia de Friedrich Nietzsche sobre la filosofía de los dos siglos pasados ha sido enorme. Su obra ataca las teorías tradicionales, tanto filosóficas como morales.","edition":2009,"classifications":["Filosofía","Ilustrativa"],"editorial":"GRUPO EDITORIAL TOMO","authors":[{"name":"FRIEDRICH NIETZSCHE","biography":"Friedrich Wilhelm Nietzsche fue un filósofo, poeta, músico y filólogo alemán, considerado uno de los pensadores contemporáneos más influyentes del siglo XIX."},{"name":"Nur ein Autor","biography":"... pero dejé dos para tener más datos."}]}
{"isbn":"7503013925788","title":"AFTER DARK","description":"Cerca ya de medianoche, en esas horas en que todo se vuelve dolorosamente nítido o angustiosamente desdibujado, Mari, sentada sola a la mesa de un bar-restaurante, se toma un café mientras lee. La interrumpe un joven músico, Takahashi, al que Mari ha visto una única vez, en una cita de su hermana Eri, modelo profesional. Ésta, mientras tanto, duerme en su habitación, sumida en un sueño «demasiado perfecto, demasiado puro.","edition":2009,"classifications":["Novela","Suspenso"],"editorial":"TUSQUETS EDITORES","authors":[{"name":"HARUKI MURAKAMI","biography":"Haruki Murakami es un escritor y traductor japonés, autor de novelas y relatos. Sus obras han generado críticas positivas y numerosos premios, incluyendo los premios Franz Kafka y el Jerusalem entre otros"},{"name":"Solo Esuno","biography":"... pero dejé dos para tener más datos."}]}
{"isbn":"9786074217940","title":"LOS AÑOS DE PEREGRINACION DEL CHICO SIN COLOR","description":"Cuando Tsukuru Tazaki era adolescente, le gustaba sentarse en las estaciones a ver pasar los trenes. Ahora, con treinta y seis años, es un ingeniero que diseña y construye estaciones de tren, pero en el fondo no ha dejado de ver pasar los trenes. Lleva una vida holgada, tranquila, tal vez demasiado solitaria. Cuando conoce a Sara, algo se remueve en lo más profundo de su ser. Y revive, en particular, un episodio de su juventud: dieciséis años atrás, cuando iba a la universidad, el que había sido su grupo de amigos desde la adolescencia cortó, sin dar explicaciones, toda relación con él. Así empezó la peor época de su vida, hasta el punto de que acarició la idea del suicidio. ¿Ha acabado esa época? ¿Es posible que aquello le marcara más de lo que él cree? Tsukuru decide entonces ir en busca de cada uno de los miembros del grupo para averiguar la verdad. Con la pieza de Liszt titulada Los años de peregrinación como leit-motif, comenzará esa búsqueda, que le llevará a lugares tan dispares como la ciudad de Nagoya o Finlandia, o tan recónditos como algunos sentimientos. Decididamente, a Tsukuru le ha llegado la hora de subirse a un tren.Una entrañable novela sobre la amistad, el amor y la soledad de aquellos que todavía no han encontrado su lugar en el mundo.","edition":2016,"classifications":["Novela","Drama"],"editorial":"TUSQUETS EDITORES","authors":[{"name":"HARUKI MURAKAMI","biography":"Haruki Murakami es un escritor y traductor japonés, autor de novelas y relatos. Sus obras han generado críticas positivas y numerosos premios, incluyendo los premios Franz Kafka y el Jerusalem entre otros"},{"name":"Solo Esuno","biography":"... pero dejé dos para tener más datos."}]}
{"isbn":"9786073129053","title":"80 Aniversarius (Tercera Entrega) (80 Aniversarius 3): Queremos tanto a Eduardo del Río","description":"Este libro representa una celebración del vastísimo trabajo de Rius, que con sus millares de caricaturas e historietas y un buen ciento libros abrió el horizonte de la crítica y la denuncia a sus lectores, encausando un descontento social que no tenía forma de expresarse.","edition":2015,"classifications":["Arts & Entertainment","Hobbies y manualidades / Impresión y encuadernado de libros","Humor / Forma / Tiras cómicas y dibujos animados","Humor / General"],"editorial":"Grijalbo","authors":[{"name":"Bernardo Fernández (BEF)","biography":"Escritor, historietista y diseñador gráfico mexicano. Destacado en las tres disciplinas, se le conoce sobre todo como autor de la novela policiaca Tiempo de alacranes, ganadora de los premios Una vuelta de tuerca en México y Memorial Silverio Cañadas en la Semana Negra de Gijón."},{"name":"Andrea Candia Gajá","biography":"Escritora que a participado en varios libros"}]}
{"isbn":"9788493808891","title":"Los templos de Syrinx","description":"Por medio de un lenguaje fresco y dinámico, el autor, Miguel Ángel Cabo nos conduce a un futuro en el que el hombre vive bajo una armonía perfecta que únicamente ha podido alcanzarse restringiendo las libertades e imponiendo al pueblo una forma de actuar y pensar.","edition":2016,"classifications":["Ficción","Relatos breves"],"editorial":"Babylon","authors":[{"name":"Miguel Ángel Cabo","biography":"Escritor con gran experiencia en libros de ficción"}]}
{"isbn":"1617297946","title":"The Lightning Thief","description":"Percy Jackson and the Olympians","edition":2012,"classifications":["Fantasy","Science Fiction"],"editorial":"Riordian Co.","authors":[{"name":"Rick Riordian","biography":"Has less books than J.K. Rowling but a lot better than Harry Potter Series"}]}
{"isbn":"1617292817","title":"IT","description":"It was the most important story in early 80's. Presented a very nice clown to kids.","edition":1982,"classifications":["Horror","Suspense"],"editorial":"Kings Co.","authors":[{"name":"Stephen King","biography":"Experienced writer, created more than 80 best seller horror series following H.P. Lovacraft teachings, styles and people characteristics"}]}
